#### Quiz 1
- `input`을 이용하여 숫자를 입력받는 코드를 작성하시오.
    - 문자가 입력되면 에러 메시지를 보내고 다시 숫자를 입력받도록 만들어 주세요.
- while, try-except, input() 이용


- 결과
```
insert number : python
숫자를 입력해주세요.
insert number : !!!
숫자를 입력해주세요.
insert number : 1234
숫자가 입력되었습니다 :  1234
```

In [1]:
# TODO

insert number : python
숫자를 입력해주세요.
insert number : !!!
숫자를 입력해주세요.
insert number : 1234
숫자가 입력되었습니다 : 1234

In [4]:
num = input("insert number : ")
while(True):
    try:
        num = int(input("insert number : "))
        print("숫자가 입력되었습니다 : {}".format(num))
        break
#     except:
#         print("숫자를 입력해주세요.")
    except Exception as e:
        print("숫자를 입력해주세요.")
#     if type(num) == 'int':
#         print("숫자가 입력되었습니다 : {}".format(num))
#         break
#     else:
#         print("숫자를 입력해주세요.") 
#         num = input("insert number : ")

insert number : python
insert number : ddd
숫자를 입력해주세요.
insert number : 1234
숫자가 입력되었습니다 : 1234

In [4]:
a =123
type(type(a))

type

#### Quiz 2
- 이자율을 입력 받을때 이자율이 3 ~ 10 사이로 입력되도록 Account 클래스를 작성해주세요.
- 3% 미만의 이자율을 객체로 만들때 생성하면 "이자율을 3% 이상으로 설정해주세요." 메시지와 함께 에러를 발생
- 10% 초과의 이자율을 객체로 만들때 생성하면 "이자율을 10% 이하로 설정해주세요." 메시지와 함께 에러를 발생
- if, elif, raise, class, Exception, 비교연산자 사용


- 결과

```
# 객체 생성 1
account1 = Account(2)

# 에러 발생 1
LowInterest: 이자율을 1.03 이상으로 설정해주세요.

# 객체 생성 2
account2 = Account(13)

# 에러 발생 2
HighInterest: 이자율을 1.10 이하로 설정해주세요.

# 객체 생성 3
account1 = Account(7)
account1.disp()

# 결과 출력
계좌에 설정된 이자율은 7.0% 입니다

```

In [2]:
# TODO

In [18]:
class LowInterest(Exception):
    def __str__(self):
        return "이자율을 3% 이상으로 설정해주세요."
class HighInterest(Exception):
    def __str__(self):
        return "이자율을 10% 이하로 설정해주세요."
class Account:
    def __init__(self, interest):
        if(interest < 3):
            raise LowInterest()
        elif interest > 10:  
            raise HighInterest()
        else:
            self.interest = float(interest)
    def disp(self):
        print("계좌에 설정된 이자율은 {}% 입니다".format(self.interest))
        
            
    # TODO

In [4]:
account1 = Account(2)

LowInterest: 이자율을 3% 이상으로 설정해주세요.

In [15]:
account1 = Account(2)

LowInterest: 이자율을 3% 이상으로 설정해주세요.

In [4]:
account1 = Account(11)

HighInterest: 이자율을 10% 이하로 설정해주세요.

In [9]:
account1 = Account(11)

HighInterest: 이자율을 10% 이하로 설정해주세요.

In [5]:
try:
    account1 = Account(15)
except Exception as e:
    print(e)

이자율을 10% 이하로 설정해주세요.

In [16]:
try:
    account1 = Account(15)
except Exception as e:
    print(e)

이자율을 10% 이하로 설정해주세요.

In [6]:
account1 = Account(7)
account1.disp()

'계좌에 설정된 이자율은 7.0% 입니다'

In [19]:
account1 = Account(7)
account1.disp()

계좌에 설정된 이자율은 7.0% 입니다

#### Quiz 3
- 퍼즐 스트라이크 게임 만들기
    - 0~9 까지의 숫자 세개를 랜덤으로 생성
    - 랜덤으로 생성된 숫자는 중복되면 안됨
    - 세개의 숫자를 입력받아 랜덤으로 생성된 세개의 숫자를 맞추는 게임
    - 세개의 숫자를 맞출때까지 계속 숫자를 입력받음
    - 세개의 숫자중에 자릿수와 숫자가 맞으면 strike
    - 세개의 숫자중에 숫자는 맞지만 자리수가 안 맞으면 ball
    - 아무것도 안 맞으면 out
    - 모두 맞추면 입력한 횟수를 출력하고 반복문 종료

    - 예시
        - 랜덤한 숫자 : 6 2 8
        - 입력 1 : 3 7 6
            - 출력 : 0S 1B
            - 설명 : 숫자 6이 있지만 자릿수가 틀림
        - 입력 2 : 7 3 9
            - 출력 : OUT
            - 설명 : 입력한 모든 숫자가 없으므로 out
        - 입력 3 : 6 8 2
            - 출력 : 1S 2B 
            - 설명 : 숫자 6은 자릿수까지 맞으므로 1 strike
            - 설명 : 숫자 8, 2는 자릿수가 틀리므로 2 ball
        - 입력 4 : 6 2 8
            - 출력 : 3S
            - 설명 : 입력한 모든 숫자의 숫자와 자릿수가 맞으므로 3 strike

<p style="text-align:center;">랜덤한 숫자 : 6, 2, 8<p>

|횟수|숫자1|숫자2|숫자3| 판정 |
|----|-----|-----|-----|------|
|  1 |  3  |  7  |  6  | 0S 1B| 
|  2 |  7  |  3  |  9  |  OUT | 
|  3 |  6  |  8  |  2  | 1S 2B| 
|  4 |  6  |  2  |  8  | 3S 0B|

In [18]:
import random

# TODO

[6, 8, 1]
숫자 3개를 입력하세요(띄어쓰기로 구분) : 8 1 9
0S 2B
숫자 3개를 입력하세요(띄어쓰기로 구분) : 6 8 3
2S 0B
숫자 3개를 입력하세요(띄어쓰기로 구분) : 4 5 2
OUT
숫자 3개를 입력하세요(띄어쓰기로 구분) : 6 8 1
3S 0B
입력횟수 : 4

In [5]:
def play_baseball(answer, in_num): 
    st_cnt, bl_cnt = 0, 0
    # 1. strike 
    for i in range(0,3):
        if (str(answer[i]) == in_num[i]):
                st_cnt += 1
        for j in range(0,3): 
            if (i != j and str(answer[i]) == in_num[j]):
                bl_cnt += 1
    return st_cnt, bl_cnt

In [69]:
# 중복된 숫자까지 허용된 모드
def same_play_baseball(answer, in_num): 
    st_cnt, bl_cnt = 0, 0
    chk = [False, False, False]
    chk_nums = []
    # 1. strike 자릿수 체크
    for i in range(0,3):
        if (str(answer[i]) == in_num[i]):
            st_cnt += 1
            chk[i] = True
            chk_nums.append(answer[i])
            
    # 2. ball 체크
        # 단, 정답에서 스트라이크 된 숫자 && 자리 제외
        # 단, 제출 답에서 스트라이크 된 자리 제외 
        # 단, 정답이 중복되었고, 제출에서 카운트가 없는 상황이라면?
            # 정답: 5 4 5 / 제출: 3 5 7 >> 1B인가 2B 인가
            # 반대의 경우) 정답: 1 3 5 / 제출: 3 6 3 >> 1B인가 2B 인가
            # 1B일 경우 정답에서 ball도 체크해야 
    print(chk_nums)
    for j in range(0,3):
        if ( (answer[j] in chk_nums) and (chk[j] == True) ):
            continue
        print(chk)
        for k in range(0,3):
            if ( in_num[k] in chk_nums ):
                continue
            if ( (str(answer[j]) == in_num[k]) and (j != k) and (chk[j] == False) ):
                print("ball :", j, k, answer[j], in_num[k], sep = '\t')
                bl_cnt += 1
                chk_nums.append(in_num[k])
    return st_cnt, bl_cnt

In [ ]:
# 정답 생성
import random
answer = []
cnt = 0
while(cnt < 3):
    nn = random.randint(0,9)
    if nn not in answer:
        answer.append(nn)
        cnt += 1
answer = [1, 3, 7]
print("랜덤한 숫자 : {}".format(answer))

# 경기
play_cnt = 0
while(True):
    in_num = list(input("숫자 3개를 입력하세요(띄어쓰기로 구분) :").split())
    play_cnt += 1
    # st_cnt, bl_cnt = play_baseball(answer, in_num)
    st_cnt, bl_cnt = same_play_baseball(answer, in_num)
    if(bl_cnt == 0 and st_cnt == 0):
        print("OUT")
    elif(st_cnt == 3):
        print(st_cnt, "S ", bl_cnt, "B")
        break
    else:
        print(st_cnt, "S ", bl_cnt, "B")
print("입력횟수: ", play_cnt)

랜덤한 숫자 : [1, 3, 7]
숫자 3개를 입력하세요(띄어쓰기로 구분) :3 5 3
[]
[False, False, False]
[False, False, False]
ball :	1	0	3	3
[False, False, False]
0 S  1 B

In [4]:
aaa = [5, 5, 5]
in_num = list(input("숫자 3개를 입력하세요(띄어쓰기로 구분) :").split())

st_cnt, bl_cnt = 0, 0
chk = [False, False, False]
for i in range(0,3):
    if (str(aaa[i]) == in_num[i]):
            st_cnt += 1
            chk[i] = True
    for j in range(0,3): 
        if (i != j and str(aaa[i]) == in_num[j]):
            if(chk[i] == True):
                print(i, j, aaa[i], in_num[j], sep = '\t')
                continue
            bl_cnt += 1

숫자 3개를 입력하세요(띄어쓰기로 구분) :3 4 5

## pandas!

#### Quiz 1
- 아래와 같이 데이터 프레임을 만드세요.
- Column
    - line(공장라인) : line1, line2, line3 중 하나의 데이터를 랜덤하게 저장
    - good(양품) : 100 ~ 200 중 랜덤한 정수
    - bad(불량) : 0 ~ 100 중 랜덤한 정수
    - date(날짜) : 1 ~ 5 중 랜던한 정수
- Row 데이터 : 10개

In [7]:
# TODO

    line  good  bad  date
0  line3   168   32     1
1  line2   116   41     4
2  line3   151   91     2
3  line3   131   89     1
4  line1   103   11     1
5  line3   125    2     4
6  line2   162   58     5
7  line2   144   21     4
8  line1   155   51     2
9  line3   140   82     5

In [28]:
import random
ls = ["line1", "line2", "line3"]
lines, good, bad, date = [], [], [], []
for _ in range(0,10):
    lines.append(random.choice(ls))
    good.append(random.randint(100, 200))
    bad.append(random.randint(0, 100))
    date.append(random.randint(1, 5))

params = {
    "line": lines,
    "good": good,
    "bad": bad,
    "date": date
}
line_df = pd.DataFrame(params)
line_df

    line  good  bad  date
0  line2   129   81     1
1  line2   123    5     4
2  line3   172   71     5
3  line1   125   18     5
4  line3   195   52     2
5  line3   123   99     3
6  line2   165  100     2
7  line2   200   26     3
8  line2   186   32     3
9  line2   104   97     2

#### Quiz 2
- 위의 데이터 프레임에서 전체 양품수, 전체 불량수, 불량률을 소수 둘째 자리까지 출력하세요.

In [8]:
# TODO

print("전체 양품수 : {}, 전체 불량수 : {}".format(total_items, bad_items))
print("전체 불량률 : {} %".format(bad_rate))

전체 양품수 : 1873, 전체 불량수 : 478
전체 불량률 : 25.52 %

In [37]:
import numpy as np
total_items = np.sum(line_df["good"] + line_df["bad"])
bad_items = np.sum(line_df["bad"])

bad_rate = round((bad_items/total_items) * 100, 2)


print("전체 양품수 : {}, 전체 불량수 : {}".format(total_items, bad_items))
print("전체 불량률 : {} %".format(bad_rate))

전체 양품수 : 2103, 전체 불량수 : 581
전체 불량률 : 27.63 %

#### Quiz 3
- 생산라인별 전체 good(양품), bad(불량) 수를 데이터 프레임으로 출력하세요.
- groupby 사용

In [9]:
# TODO

    line  good  bad
0  line1   258   62
1  line2   422  120
2  line3   715  296

In [9]:
line_df.groupby("line").agg(sum).reset_index()[["line", "good", "bad"]]

    line  good  bad
0  line1   594  174
1  line2   238   92
2  line3   590  197

#### Quiz 4
- 생산 라인별 불량률을 출력하세요.

In [10]:
# TODO

    line  good  bad  date  bad_rate
0  line1   258   62     3     19.38
1  line2   422  120    13     22.14
2  line3   715  296    13     29.28

In [38]:
new_df = line_df.groupby("line").agg(sum).reset_index()
new_df["bad_rate"] = round((new_df['bad']/(new_df["good"] + new_df['bad']))* 100, 2)
new_df

    line  good  bad  date  bad_rate
0  line1   125   18     5     12.59
1  line2   907  341    15     27.32
2  line3   490  222    10     31.18

#### Quiz 5
- 날짜별 전체 good(양품), bad(불량) 수를 데이터 프레임으로 출력하세요.
- groupby 사용

In [11]:
# TODO

   date  good  bad
0     1   402  132
1     2   306  142
2     4   385   64
3     5   302  140

In [11]:
date_df = line_df.groupby("date").agg(sum).reset_index()
date_df

   date  good  bad
0     1   296   51
1     2   274  123
2     3   219   93
3     4   450  101
4     5   183   95

#### Quiz 6
- 날짜별 불량률을 출력하세요.

In [12]:
# TODO

   date  good  bad  bad_rate
0     1   402  132     24.72
1     2   306  142     31.70
2     4   385   64     14.25
3     5   302  140     31.67

In [36]:
date_df["bad_rate"] = round((date_df['bad']/(date_df["good"] + date_df['bad']))* 100, 2)
date_df

   date  good  bad  bad_rate
0     1   296   51     14.70
1     2   274  123     30.98
2     3   219   93     29.81
3     4   450  101     18.33
4     5   183   95     34.17

#### Quiz 7
- 아래의 데이터를 pivot_table을 이용하여 출력하세요.
    - 라인별, 날짜별, 양품수
    - 라인별, 날짜별, 불량수
    - 라인별, 날짜별, 불량률
- NaN 데이터는 0으로 변경하세요.
- pivot_table, fillna 사용

In [13]:
# 라인별, 날짜별, 양품수

# TODO

pivot_df_1

           1      2      4      5
line1  103.0  155.0    0.0    0.0
line2    0.0    0.0  260.0  162.0
line3  299.0  151.0  125.0  140.0

In [34]:
pivot_df_1 = line_df.pivot_table("good",index =["line"],columns=["date"], aggfunc=np.sum).fillna(0)
#pivot_df_1[pivot_df_1.isnull()] = 0.0
pivot_df_1

date       1      2      3      4      5
line
line1    0.0    0.0    0.0    0.0  125.0
line2  129.0  269.0  386.0  123.0    0.0
line3    0.0  195.0  123.0    0.0  172.0

In [14]:
# 라인별, 날짜별, 불량수

# TODO

pivot_df_2

           1     2     4     5
line1   11.0  51.0   0.0   0.0
line2    0.0   0.0  62.0  58.0
line3  121.0  91.0   2.0  82.0

In [31]:
pivot_df_2 = line_df.pivot_table("bad","line","date", aggfunc=np.sum)
pivot_df_2[pivot_df_2.isnull()] = 0.0
pivot_df_2

date      1      2     3    4     5
line
line1   0.0    0.0   0.0  0.0  18.0
line2  81.0  197.0  58.0  5.0   0.0
line3   0.0   52.0  99.0  0.0  71.0

In [15]:
# 라인별, 날짜별, 불량률

# TODO

pivot_df_3

           1      2      4      5
line1   9.65  24.76   0.00   0.00
line2   0.00   0.00  19.25  26.36
line3  28.81  37.60   1.57  36.94

In [35]:
# pivot_df_3 = date_df.pivot_table("bad_rate","line","date", aggfunc=np.sum)
# pivot_df_3[pivot_df_3.isnull()] = 0.0
# pivot_df_3

pivot_df_3 = round((pivot_df_2 / (pivot_df_1 + pivot_df_2)) * 100, 2)
pivot_df_3.fillna(0, inplace= True)
pivot_df_3

date       1      2      3     4      5
line
line1   0.00   0.00   0.00  0.00  12.59
line2  38.57  42.27  13.06  3.91   0.00
line3   0.00  21.05  44.59  0.00  29.22

# database

In [41]:
import MySQLdb

In [42]:
# world 데이터 베이스 : localhost 대신 본인의 서버 public ip를 사용하세요.
data = ["", "root", "", "world"]
world_db = MySQLdb.connect(*data)

In [46]:
# 예시
QUERY = """
    SELECT Code, Name, GNP, Population
    FROM country
"""

df = pd.read_sql(QUERY, world_db)
df.tail(2)

    Code      Name     GNP  Population
237  ZMB    Zambia  3377.0     9169000
238  ZWE  Zimbabwe  5951.0    11669000

### Quiz 1
- 인구수 1000만이 넘는 국가중에 인구밀도가 가장 높은 상위 3개 국가의 국가코드와 인구밀도를 출력하세요.
- 인구밀도는 소수 셋째자리에서 반올림하여 소수 둘째자리까지 출력하세요.

In [49]:
QUERY1 = """
select code, truncate(population/SurfaceArea,2) as pop_per_sur from country
where population > 10000000
order by pop_per_sur desc
limit 3
"""

In [50]:
df = pd.read_sql(QUERY1, world_db)
df

  code  pop_per_sur
0  BGD       896.92
1  TWN       615.01
2  KOR       471.10

In [5]:
df = pd.read_sql(QUERY1, world_db)
df

  code  pop_per_sur
0  BGD       896.92
1  TWN       615.01
2  KOR       471.11

### Quiz 2
- 위에서 출력된 결과를 아래와 같이 피봇하여 출력되도록 쿼리를 작성하세요.

In [39]:
QUERY2 = """
select 
	( select code from country 
	where population >= 10000000 
	order by Population/SurfaceArea desc
	limit 1 ) as rank1,
	( select code from country 
	where population >= 10000000 
	order by Population/SurfaceArea desc
	limit 1, 1 ) as rank2,
	( select code from country 
	where population >= 10000000 
	order by Population/SurfaceArea desc
	limit 2, 1 ) as rank3
union
select
	( select round(Population/SurfaceArea, 2) as pop_per_sur
	from country
	where population >= 10000000
	order by pop_per_sur desc
	limit 1 ) as rank1,
	( select round(Population/SurfaceArea, 2) as pop_per_sur
	from country
	where population >= 10000000
	order by pop_per_sur desc
	limit 1, 1 ) as rank2,
	( select round(Population/SurfaceArea, 2) as pop_per_sur
	from country
	where population >= 10000000
	order by pop_per_sur desc
	limit 2, 1 ) as rank3

"""

In [43]:
df = pd.read_sql(QUERY2, world_db)
df

    rank1   rank2   rank3
0     BGD     TWN     KOR
1  896.92  615.01  471.11

In [7]:
df = pd.read_sql(QUERY2, world_db)
df

    rank1   rank2   rank3
0     BGD     TWN     KOR
1  896.92  615.01  471.11

### Quiz 3
- 국가의 인구가 5000만이 넘는 국가중에서 국가별 사용하는언어의 비율이 가장 높은 언어와 사용비율과 사용인구를 출력하세요.
- 사용하는 언어의 비율이 높은 국가의 언어순으로 5개의 언어와 국가를 출력하세요.

In [64]:
QUERY3 = """
SELECT cl.countrycode as code, LANGUAGE, percentage, truncate((population*percentage/100),1) as language_population
FROM countrylanguage AS cl
JOIN ( 
    SELECT *
    FROM country
    WHERE population > 50000000) AS con ON con.code = cl.countrycode
ORDER BY percentage DESC
LIMIT 5
"""

In [65]:
pd.read_sql(QUERY3, world_db)

  code    LANGUAGE  percentage  language_population
0  JPN    Japanese        99.1          125573574.0
1  EGY      Arabic        98.8           67648360.0
2  BGD     Bengali        97.7          126184435.0
3  BRA  Portuguese        97.5          165862125.0
4  GBR     English        97.3           58013568.2

In [9]:
pd.read_sql(QUERY3, world_db)

  code    language  percentage  language_population
0  JPN    Japanese        99.1          125573572.0
1  EGY      Arabic        98.8           67648362.0
2  BGD     Bengali        97.7          126184431.0
3  BRA  Portuguese        97.5          165862125.0
4  GBR     English        97.3           58013570.0